pages/17_High_Spirits.html
<!DOCTYPE html>
<html xmlns="http://www.w3.org/1999/xhtml"
      xmlns:og="http://ogp.me/ns#"
      xmlns:fb="https://www.facebook.com/2008/fbml">
<head>
    <title>High Spirits.</title>
    <!-- Using the latest rendering mode for IE -->
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta charset="utf-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">

    <!-- Open Graph tags -->

            <meta property="og:type" content="article"/>
            <meta property="og:title" content="High Spirits."/>
            <meta property="og:url" content="http://thecastle.github.io/thecastle/pages/17_High_Spirits.html"/>

    <!-- Bootstrap -->
        <link rel="stylesheet" href="http://thecastle.github.io/thecastle/theme/css/bootstrap.readable.min.css" type="text/css"/>
    <link href="http://thecastle.github.io/thecastle/theme/css/font-awesome.min.css" rel="stylesheet">
    <link href="http://thecastle.github.io/thecastle/theme/css/pygments.css" rel="stylesheet">
    <link rel="stylesheet" href="http://thecastle.github.io/thecastle/theme/css/style.css" type="text/css"/>
    <!-- JavaScript plugins (requires jQuery) -->


</head>
<body>
<nav class="navbar navbar-default navbar-fixed-top" role="navigation">
    <div class="container">
        <div class="navbar-header">
            <button type="button" class="navbar-toggle" data-toggle="collapse" data-target=".navbar-ex1-collapse">
                <span class="sr-only">Toggle navigation</span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
            </button>
            <a href="http://thecastle.github.io/thecastle" class="navbar-brand">The Castle Mountaineering Club.</a>
        </div>
        <div class="collapse navbar-collapse navbar-ex1-collapse">
            <ul class="nav navbar-nav">
            </ul>
            <ul class="nav navbar-nav navbar-right">
                <li><a href="http://thecastle.github.io/thecastle/archives.html"><i class="icon-th-list"></i>Archives</a></li>
            </ul>
        </div>
        <!-- /.navbar-collapse -->
    </div>
</nav>
<!-- /.navbar -->
<div class="container">
    <div class="row">
        <div class="col-lg-9">
    <section id="content" class="body">

        <div class="entry-content">
            <div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">High Spirits</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">High Spirits</h2>
<div class="outline-text-2" id="text-1">
<div class="export">
<p>
&lt;p&gt;
&lt;em&gt;by Steve France&lt;/em&gt;
&lt;/p&gt;
</p>

</div>

<p>
Some years ago, whilst visiting the battle site of Culloden
Field on a damp and misty September day, I was subjected to a
feeling of utter dread.  Subconscious emotions told me, &ldquo;You must
get away!&rdquo; People could wander round the graves from clan to clan
for hours but my whole visit lasted less than twenty minutes.  A
year later in the middle of the vast winter landscape of the
Cairngorms, I suffered the same experience.
</p>

<p>
It was a typical Castle plod, made worse by dense cloud and
deteriorating conditions, but our spirits were high even though
Chris Holmes, Dick Savage and myself felt more at home on rock
than playing the mountain man. The steep slog towards the
Cairngorm plateau was no fun, especially when the skiers were
gently gliding past on the ski tow whilst making sarcastic
comments and giving us sneering looks. Our replies ranged from
&ldquo;Yes, we do enjoy walking up&rdquo; to &ldquo;No, it&rsquo;s not tiring when you&rsquo;re
fit&rdquo;.
</p>

<p>
Before our language became offensive we saw an ideal
opportunity for one upmanship. By climbing a high banking of snow
at the side of the tow run, we could jump and grab the unoccupied
tow bars!
</p>

<p>
Weee!&#x2026; up we went and after a short period spent adjusting
the angle of our boots on the snow, a perfect glide was obtained
on our Vibram skis! Protests were heard further down the tow from
&ldquo;paying&rdquo; participants and we raised our overmitts in reply  they
could not see the two fingers inside, but I think that the
message was plain enough!
</p>

<p>
Once over the wind swept edge of the plateau we were on our
own and left to enjoy the beauty of the mountain solitude. The
clouds were white with snow as we came to the col beside Lochan
Buidhe. The mountains merged with the snow into total whiteness,
so bright that our duvets appeared translucent. The silence was
oppressive except for the crunching of the snow. I remember
vividly the way we walked, as if in a slow motion action replay.
This was my first and only &ldquo;white out&rdquo;, the only reality was
the person in front until suddenly a snow bank resolved itself
into focus in front of my eyes. It was not the snow bank that I
saw but a hole in the snow,  approximately one metre square.
We entered, and as the tunnel opened out, were stunned with
surprise by the ice village which greeted our eyes. It was
without doubt the Ritz of all snow holes with room after room
each connected to the other and complete with its own table,
chairs, raised bed and shelving systems&#x2026; all made out of ice.
It must have been a distant relic from a winter survival course
at Glenmore Lodge but the unnatural silence, together with the
ambient light that soaked through the ice walls, transformed the
shelter into a mortuary of past memories. Imagining ghosts,
goblins and yetis, we ran out of the tunnel and back to the
welcoming &ldquo;white&rdquo;.
</p>

<p>
Another mile and our high spirits changed.  I can remember
approaching the final slopes trying to find an excuse to turn
back, but there was no rational explanation why, and so we went
on. The cairn was found quite by accident  we were standing on
it!  because the snow covered all but the brass plaque on top
which shows the various peaks and directions. Even though we had
reached our goal, the summit of Ben Macdui gave us no pleasure.
There was no vista to enjoy, only grey dread and an urge to go
home quickly. The usual summit rest, comprising a bite to eat
whilst soaking in self-satisfaction, was limited to a quick photo
before we legged it back down the mountain.
</p>

<p>
The campsite talk that night re-lived the arduous knee deep
slush and the &ldquo;white out&rdquo;, but we never talked about Ben Macdui.
I am sure that strange perception of malevolence was shared
subconsciously between us, although at the time, I never gave it
much thought.
</p>

<p>
Recently I was reading a book entitled &ldquo;Scottish Ghost
Stories&rdquo; and to my surprise, discovered that there is an alleged
ghoul on Ben Macdui called &ldquo;The Grey Man&rdquo;. Although never seen,
it has been responsible for campers fleeing for their lives,
leaving tents and equipment behind, totally convinced of their
impending doom if they remained there any longer.
Gruesome stuff!
</p>
</div>
</div>

        </div>
    </section>
        </div>
        <div class="col-lg-3 well well-sm" id="sidebar">

<aside>
    <section>

        <ul class="list-group list-group-flush">
             <li class="list-group-item"><h4><i class="icon-search icon-large"></i>Search</h4></li>

                   <li class="list-group-item"><h4><i class="icon-book icon-large"></i>Pages</h4></li>



                <li class="list-group-item"><a href="http://thecastle.github.io/thecastle/tags.html"><h4><i class="icon-tags icon-large"></i>Tags</h4></a></li>
        </ul>
    </section>
</aside>        </div>
    </div>
</div>
<footer>
    <div class="container">
        <hr>
        <p class="pull-right"><i class="icon-arrow-up"></i> <a href="#">Back to top</a></p>


        <p>&copy;  The Castle Mountaineering Club. &middot; Powered by <a href="https://github.com/DandyDev/pelican-bootstrap3" target="_blank">pelican-bootstrap3</a>,
            <a href="http://docs.getpelican.com/" target="_blank">Pelican</a>,
            <a href="http://getbootstrap.com" target="_blank">Bootstrap</a></p>
    </div>
</footer>
<!-- Include all compiled plugins (below), or include individual files as needed -->
<script src="http://thecastle.github.io/thecastle/theme/js/bootstrap.min.js"></script>

<!-- Enable responsive features in IE8 with Respond.js (https://github.com/scottjehl/Respond) -->
<script src="http://thecastle.github.io/thecastle/theme/js/respond.min.js"></script>


</body>
</html>